export const HEADER_MEGA_MENU = {
	"ОБЛИЧЧЯ": {
		columns: [
			{
				sections: [
					{
						title: "ОЧИЩЕННЯ ОБЛИЧЧЯ",
						items: [
							"Ензимна пудра",
							"Гідрофільна олія",
							"Пінка",
							"Бальзам",
							"Пілінг - гель",
							"Демакіяж",
							"Скраб",
						],
					},
				],
			},
			{
				sections: [
					{
						title: "КРЕМА ДЛЯ ОБЛИЧЧЯ",
						items: ["Крем", "Бальзам", "Гель"],
					},
					{
						title: "ТОНЕРИ ДЛЯ ОБЛИЧЧЯ",
						items: ["Тонер", "Міст"],
					},
				],
			},
			{
				sections: [
					{
						title: "ЗАХИСТ ВІД СОНЦЯ", link: '/katehoriji/sunProtection',
						items: [],
					},
					{
						title: "МАСКИ ДЛЯ ОБЛИЧЧЯ",
						items: [
							"Альгінатні",
							"Гідрогелеві",
							"Глиняні",
							"Маска-плівка",
							"Нічні маски",
							"Тканинні",
						],
					},
				],
			},
			{
				sections: [
					{
						title: "ДОГЛЯД ЗА ШКІРОЮ НАВКОЛО ОЧЕЙ",
						items: ["Креми під очі", "Сироватки під очі", "Патчі під очі"],
					},
					{
						title: "ДОГЛЯД ЗА ГУБАМИ",
						items: ["Бальзами для губ", "Маски для губ", "Олія для губ", "Скраб для губ"],
					},
				],
			},
		],
	},
	"ВОЛОССЯ": {
		columns: [
			{
				sections: [
					{title: "ШАМПУНІ ДЛЯ ВОЛОССЯ", items: []},
					{title: "КОНДИЦІОНЕРИ ДЛЯ ВОЛОССЯ", items: []},
					{title: "МАСКИ ДЛЯ ВОЛОССЯ", items: []},
					{title: "СИРОВАТКИ ДЛЯ ВОЛОССЯ", items: []},
					{title: "СПРЕЙ ДЛЯ ВОЛОССЯ", items: []},
				],
			},
			{
				sections: [
					{title: "ПІЛІНГИ ДЛЯ ВОЛОССЯ", items: []},
					{title: "ОЛІЙКИ ДЛЯ ВОЛОССЯ", items: []},
					{title: "ЕМУЛЬСІЇ ДЛЯ ВОЛОССЯ", items: []},
					{title: "ФІЛЕРИ ДЛЯ ВОЛОССЯ", items: []},
				],
			},
			{
				sections: [
					{
						title: "АКСЕСУАРИ",
						items: ["Гребінці для волосся", "Масажери для волосся", "Резинки для волосся"],
					},
				],
			},
		],
	},
	"МАКІЯЖ": {
		columns: [
			{
				sections: [
					{title: "ОЧІ", items: ["Підводка для очей", "Туш", "Консилер"]},
					{title: "ГУБИ", items: ["Тінт для губ"]},
				],
			},
			{
				sections: [
					{
						title: "ОБЛИЧЧЯ",
						items: ["BB крем", "Кушон", "Тональний крем", "Пудра", "Рум'яна", "CC крем"],
					},
				],
			},
		],
	},
	"ТІЛО": {
		columns: [
			{
				sections: [
					{title: "ГЕЛЬ ДЛЯ ДУШУ", items: []},
					{title: "КРЕМ ДЛЯ ТІЛА", items: []},
					{title: "СПРЕЙ ДЛЯ ТІЛА", items: []},
					{title: "ЛОСЬЙОН ДЛЯ ТІЛА", items: []},
					{title: "КРЕМ ДЛЯ РУК", items: []},
					{title: "МАСКИ ДЛЯ РУК ТА НІГ", items: []},
				],
			},
			{
				sections: [
					{title: "ПРОБНИКИ ТА МІНІ-ФОРМАТИ ДЛЯ ТІЛА", items: []},
					{title: "АКСЕСУАРИ", items: []},
				],
			},
		],
	},
	"НАБОРИ & ПОДАРУНКИ": {
		columns: [
			{
				sections: [
					{title: "ДЛЯ ОБЛИЧЧЯ", items: []},
					{title: "ДЛЯ ТІЛА", items: []},
					{title: "ДЛЯ ВОЛОССЯ", items: []},
					{title: "МІНІ-ФОРМАТИ В НАБОРАХ", items: []},
					{title: "ПРОБНИКИ", items: []},
					{title: "АКСЕСУАРИ", items: []},
				],
			},
			{
				sections: [
					{title: "ПОДАРУНКОВІ СЕРТИФІКАТИ", items: []},
					{title: "ПОДАРУНКИ ДО 1000 UAH", items: [], link: '/katehoriji/folds?toPrice=1000'},
					{title: "ПОДАРУНКИ ДО 2000 UAH", items: [], link: '/katehoriji/folds?toPrice=2000'},
				],
			},
		],
	},
};

const TEXTS = {
	// обличчя
	'ОЧИЩЕННЯ ОБЛИЧЧЯ': 'Очищення',
	'КРЕМА ДЛЯ ОБЛИЧЧЯ': 'Крем для обличчя',
	'ТОНЕРИ ДЛЯ ОБЛИЧЧЯ': 'Тонер',
	'ДОГЛЯД ЗА ШКІРОЮ НАВКОЛО ОЧЕЙ': 'для шкіри під очима',

	'Пінка': 'пінка для вмивання',
	'Бальзам': 'бальзам для очищення',
	'Пілінг - гель': 'пілінг гель',
	'Крем': 'крем для обличчя',
	'Гель': 'гель для обличчя',
	'Міст': 'міст для обличчя',
	'Скраб': 'скраб для обличчя',
	'Альгінатні': 'альгінатні маски',
	'Гідрогелеві': 'гідрогелеві маски',
	'Глиняні': 'глиняні маски',
	'Тканинні': 'тканинні маски',
	'Креми під очі': 'крем під очі',
	'Сироватки під очі': 'сироватка під очі',
	'Патчі під очі': 'патчі',
	'Бальзами для губ': 'бальзам для губ',
	'Маски для губ': 'маска для губ',

	// волосся
	'ШАМПУНІ ДЛЯ ВОЛОССЯ': 'шампуні',
	'КОНДИЦІОНЕРИ ДЛЯ ВОЛОССЯ': 'кондиціонери',
	//'ПІЛІНГИ ДЛЯ ВОЛОССЯ': 'пілінг гель',
	'ОЛІЙКИ ДЛЯ ВОЛОССЯ': 'олія для волосся',
	//'АКСЕСУАРИ': 'аксесуари для догляду',

	//'Гребінці для волосся': '',
	//'Масажери для волосся': '',
	//'Резинки для волосся': '',

	// макіяж
	'ОЧІ': 'для очей',
	'ГУБИ': 'для губ',
	'ОБЛИЧЧЯ': 'для лиця',

	'BB крем': 'бб крем',
	'CC крем': 'сс крем',

	// тіло
	//'СПРЕЙ ДЛЯ ТІЛА': '',
	'МАСКИ ДЛЯ РУК ТА НІГ': 'маски для рук і ніг',
	//'ПРОБНИКИ ТА МІНІ-ФОРМАТИ ДЛЯ ТІЛА': 'пробники',
	//'АКСЕСУАРИ': 'аксесуари для догляду',

	// набори
	//'ДЛЯ ОБЛИЧЧЯ': 'догляд для обличчя',
	//'ДЛЯ ТІЛА': 'догляд для тіла',
	//'ДЛЯ ВОЛОССЯ': 'догляд для волосся',
	//'МІНІ-ФОРМАТИ В НАБОРАХ': '',
	//'ПРОБНИКИ': '',
	//'АКСЕСУАРИ': '',
	//'ПОДАРУНКОВІ СЕРТИФІКАТИ': '',
	//'ПОДАРУНКИ ДО 1000 UAH': '',
	//'ПОДАРУНКИ ДО 2000 UAH': '',
};

export function filterProductsBy(products, isCategory, text) {
	const dbText = (TEXTS[text] ?? text).toLowerCase();
	return products.filter((pr) => {
		return pr.category?.toLowerCase() === dbText || pr.subCategory?.toLowerCase() === dbText || pr.subSubCategory?.toLowerCase() === dbText;
	});
}
